<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\News;
use App\Models\Tag;
use Illuminate\Database\Seeder;
use Illuminate\Support\Arr;
use Illuminate\Support\Str;

class NewsSeeder extends Seeder
{
    public function run()
    {
        $arabicCategories = Category::where('language', 'ar')->pluck('id')->toArray();
        $englishCategories = Category::where('language', 'en')->pluck('id')->toArray();

        $arabicTags = Tag::where('language', 'ar')->pluck('id')->toArray();
        $englishTags = Tag::where('language', 'en')->pluck('id')->toArray();


        $news = News::create([
            'title' => "“سالك” توقع اتفاقية رفع حصتها في “أولام الزراعية” إلى 80.01% بـ 6.7 مليار ريال",
            'sub_title' => "“سالك” توقع اتفاقية رفع حصتها في “أولام الزراعية” إلى 80.01% بـ 6.7 مليار ريال",
            'source' => 'صحيفة مال',
            'language' => 'ar',
                       'publisher_id' => "صحيفه مال",

            'slug' => Str::slug("سالك  توقع اتفاقية رفع حصتها"),
            'show_in_slider' => 1,
            'order_slider' => 1,
            'order_featured' => 1,
            'description' => "أعلنت سالك إحدى شركات صندوق الاستثمارات العامة اليوم الأثنين عن توقيعها اتفاقية لزيادة حصتها في شركة أولام الزراعية القابضة السنغافورية من 35.43% إلى 80.01% بقيمة إجمالية تبلغ 1.78 مليار دولار (ما يعادل قرابة 6.7 مليار ريال)، على أن تكتمل كافة إجراءات الصفقة بعد الحصول على الموافقات اللازمة من الجهات ذات العلاقة.
                            وتشمل الاتفاقية خياراً لسالك لشراء الحصة المتبقية بنسبة 19.99% خلال ثلاث سنوات من تاريخ إتمام الصفقة، مما يتيح لها الانتقال إلى الاستحواذ الكامل مستقبلاً، مع الاستفادة من خبرة مجموعة أولام خلال مرحلة الانتقال.
                            وتستهدف سالك الاستثمار في قطاعي الأغذية والزراعة من أجل تعزيز الأمن الغذائي وتحقيق النمو والاستدامة عبر شراكات استراتيجية في جميع مراحل سلسلة القيمة بشكل متكامل وفعال يربط بين الأسواق العالمية والمحلية. ويأتي هذا الاستحواذ وفقاً لاستراتيجية سالك الدولية التي تهدف إلى ضمان توفر السلع الأساسية وتعزيز استدامتها من خلال تنويع الاستثمارات وربط سلاسل الإمداد وتحسين الكفاءة اللوجستية وتحقيق الريادة في قطاع الحبوب وبهذه المناسبة قال المهندس سليمان بن عبدالرحمن الرميح الرئيس التنفيذي لمجموعة سالك: “منذ استحواذنا على حصة 35.43% في أولام، أثبتت الشركة جدارتها الاستراتيجية بكونها إحدى الشركات العالمية الرائدة في تجارة السلع الأساسية، مما عزز من ثقتنا برؤيتنا الاستثمارية وطموحاتنا لتحقيق نمو مستدام. ويتوافق ذلك مع منهجية سالك في الاستثمار التي تركز على الشركات الواعدة لتلبية الاحتياجات المستقبلية في مجال الأمن الغذائي ودعم الابتكار وتكامل سلاسل الإمداد داخل المملكة وخارجها.”
                            وأشار الرميح إلى أن عملية الاستحواذ بعد اكتمالها ستتيح لشركة أولام فرصة التوسع في الأسواق بالاستفادة من قدرات سالك المحلية والدولية، وفي المقابل سوف ستعزز من مكانة سالك في قطاع الحبوب عالمياً مما يعود بالفائدة للمستهلكين على نحو ملموس عبر رفع كفاء الإنتاج وتوزيع الغذاء. بينما تضمن الاتفاقية انتقالاً سلساً تستفيد من خبرة مجموعة أولام خلال فترة الانتقال حتى إتمام الاستحواذ الكامل وفق الخيار المتاح لسالك.
                            من جهته أكد صني فيرغيز الرئيس التنفيذي لشركة أولام الزراعية القابضة: “أن الشراكة مع سالك بدأت منذ عام 2022 بهدف البحث عن آفاق جديدة للنمو والتطوير كونها شركة عالمية تستثمر في قطاع الأغذية الزراعية مضيفاً أن الشركتين تشتركان في الرؤية التي تركز على المصادر المستدامة والالتزام بتلبية الطلب المتزايد على الغذاء والأعلاف والألياف معتبراً في الوقت ذاته أنه وباكتمال الصفقة ستشهد شركة أولام الزراعية نقلة نوعية.”
                            الجدير بالذكر أن مجموعة سالك تحظى باستثمارات نوعية في سلسلة الإمدادات الغذائية العالمية سعياً منها إلى إتاحة إمكانية الوصول إلى السلع الأساسية على نطاق واسع، حيث تمتد استثماراتها الحالية عبر 5 قارات في 7 دول وتستهدف الاستثمار في 16 سلعة استراتيجية",
            'main_image' => "/storage/uploads/photos/sliders/2025-02/slider1.jpg",
            'image_description' => "صورة متعلقة بخبر استثماري هام",
            'is_published' => 1,
            'status' => 1,
            'type' => 'normal',
              'is_featured' => 1,
            'schudle_date' => null,
            'schudle_time' => null,
            'category_id' => Arr::random($arabicCategories),
            'created_at' => now()->subDay(),
            'updated_at' => now()->subDay(),
        ]);

        $news->tags()->attach($this->getRandomTags($arabicTags));

        $news1 = News::create([
            'title' => "أرباح “أديس القابضة” تقفز 81% بنهاية عام 2024 إلى 816 مليون ريال",
            'sub_title' => "أرباح “أديس القابضة” تقفز 81% بنهاية عام 2024 إلى 816 مليون ريال",
            'source' => 'صحيفة مال',
            'language' => 'ar',
             'publisher_id' => "صحيفه مال",

            'slug' => Str::slug("أرباح أديس القابضة"),
            'show_in_slider' => 1,
            'order_slider' => 2,
            'order_featured' => 2,
            'description' => "قفز صافي الربح لشركة أديس القابضة إلى 816 مليون ريال بنهاية العام 2024، مقابل 452 مليون ريال في العام الماضي بنسبة 81%، جاء ذلك عقب الإعلان اليوم عن النتائج المالية الأولية للفترة المنتهية في 31 ديسمبر 2024.
                                وبلغ الربح التشغيلي 1.9 مليار ريال نهاية عام 2024 مقابل 1.3 مليار ريال في العام الماضي بزيادة 44%.
                                كما بلغ حقوق الملكية (بعد استبعاد الحصص غير المسيطرة) في السنة الحالية 6.5 مليار ريال مقابل 5.7 مليار ريال في السنة الماضية بارتفاع 14%.
                                وبلغت ربحية السهم في السنة الحالية 0.73 ريال مقابل 0.59 ريال في السنة الماضية.
                                وقالت الشركة في بيان لها اليوم على “تداول” إنها سجلت نمواً قوياً في الإيرادات بنسبة 43.1% على أساس سنوي في السنة المالية 2024 لتبلغ 6,199.0 مليون ريال خلال السنة المالية 2024، مدفوعاً باستمرار النمو في السعودية على خلفية تشغيل المنصات الجديدة؛ والمساهمة الجديدة من الهند وإندونيسيا وتايلاند؛ إلى جانب ارتفاع معدلات الإيجار اليومي للمنصات البحرية العاملة في السعودية ومصر. كما عزز من نمو الإيرادات مساهمة قطاع المنصات البرية في ضوء نمو نشاط المنصات العاملة في الكويت والجزائر.",
            'main_image' => "/storage/uploads/photos/sliders/2025-02/slider2.png",
            'image_description' => null,
            'is_published' => 1,
            'status' => rand(1, 2),
            'type' => 'normal',
            'schudle_date' => null,
            'schudle_time' => null,
              'is_featured' => 1,
            'category_id' => Arr::random($arabicCategories),
            'created_at' => now()->subDay(),
            'updated_at' => now()->subDay(),
        ]);

        $news1->tags()->attach($this->getRandomTags($arabicTags));



        $news2 = News::create([
            'title' => "ارتفاع أرباح “نادك” إلى 775 مليون ريال نهاية عام 2024 بنسبة 156%",
            'sub_title' => "ارتفاع أرباح “نادك” إلى 775 مليون ريال نهاية عام 2024 بنسبة 156%",
            'source' => 'صحيفة مال',
            'language' => 'ar',
                       'publisher_id' => "صحيفه مال",

            'slug' => Str::slug("ارتفاع أرباح نادك"),
            'show_in_slider' => 1,
            'order_slider' => 3,
            'order_featured' => 3,
            'description' => "نما صافي الربح للشركة الوطنية للتنمية الزراعية “نادك” إلى 775 مليون ريال بنهاية العام 2024، مقابل 302 مليون ريال في العام الماضي بنسبة 156%، جاء ذلك عقب الإعلان اليوم عن النتائج المالية الأولية للفترة المنتهية في 31 ديسمبر 2024.
                            وبلغ الربح التشغيلي 389 مليون ريال نهاية عام 2024 مقابل 340 مليون ريال في العام الماضي بنمو 14%.
                            كما بلغ حقوق الملكية (بعد استبعاد الحصص غير المسيطرة) في السنة الحالية 4.29 مليار ريال نهاية عام 2024 مقابل 3.59 مليار ريال في العام الماضي بزيادة 20%.
                            وبلغت ربحية السهم في السنة الحالية 2.57 ريال مقابل 1.77 ريال في السنة الماضية.
                            وقالت الشركة في بيان لها اليوم على “تداول” إن الإيرادات للعام الحالي نمت بمقدار 0.73% مقارنة بالعام الماضي، ويرجع ذلك أساساً إلى مبيعات قطاع البروتين الجديد بقيمة 180.29 مليون ريال، وقد قابل هذه الزيادة جزئياً انخفاض في مبيعات قطاع الألبان والعصائر بنسبة 3.59% ومبيعات القطاع الزراعي بنسبة 28.50%.",
            'main_image' => "/storage/uploads/photos/sliders/2025-02/slider3.jpg",
            'image_description' => null,
            'is_published' => 1,
            'status' => rand(1, 2),
            'type' => 'normal',
            'schudle_date' => null,
              'is_featured' => 1,
            'schudle_time' => null,
            'category_id' => Arr::random($arabicCategories),
            'created_at' => now()->subDay(),
            'updated_at' => now()->subDay(),
        ]);

        $news2->tags()->attach($this->getRandomTags($arabicTags));


        $news3 = News::create([
            'title' => "أرباح “أماك” تقفز 226% بنهاية عام 2024 إلى 178 مليون ريال",
            'sub_title' => "أرباح “أماك” تقفز 226% بنهاية عام 2024 إلى 178 مليون ريال",
            'source' => 'صحيفة مال',
            'language' => 'ar',
                       'publisher_id' => "صحيفه مال",

            'slug' => Str::slug("أرباح أماك تقفز"),
            'show_in_slider' => 1,
            'order_slider' => 4,
            'order_featured' => 3,
            'description' => "قفز صافي الربح لشركة المصانع الكبرى للتعدين “أماك” إلى 178 مليون ريال بنهاية العام 2024، مقابل 55 مليون ريال في العام الماضي بنسبة 226%، جاء ذلك عقب الإعلان اليوم عن النتائج المالية الأولية للفترة المنتهية في 31 ديسمبر 2024.
                    وبلغ الربح التشغيلي 222مليون ريال نهاية عام 2024 مقابل 64 مليون ريال في العام الماضي بنمو 247%.
                    كما بلغ حقوق الملكية (بعد استبعاد الحصص غير المسيطرة) في السنة الحالية 1.25 مليار ريال نهاية عام 2024 مقابل 1.22 مليار ريال في العام الماضي بزيادة 3%.
                    وبلغت ربحية السهم في السنة الحالية 2.01 ريال مقابل 0.73 ريال في السنة الماضية.
                    وقالت الشركة في بيان لها اليوم على “تداول” إن سبب الارتفاع في الإيرادات خلال هذا العام بمبلغ 293 مليون ريال (60%) مقارنة بالعام السابق يعود إلى ارتفاع أسعار وكميات مبيعات النحاس والزنك والذهب.",
            'main_image' => "/storage/uploads/photos/sliders/2025-02/slider4.png",
            'image_description' => "صورة متعلقة بخبر استثماري هام",
            'is_published' => 1,
              'is_featured' => 1,
            'status' => rand(1, 2),
            'type' => 'normal',
            'schudle_date' => null,
            'schudle_time' => null,
            'category_id' => Arr::random($arabicCategories),
            'created_at' => now()->subDay(),
            'updated_at' => now()->subDay(),
        ]);

        $news3->tags()->attach($this->getRandomTags($arabicTags));

        $news4 = News::create([
            'title' => "أرباح “أماك” تقفز 226% بنهاية عام 2024 إلى 178 مليون ريال",
            'sub_title' => "أرباح “أماك” تقفز 226% بنهاية عام 2024 إلى 178 مليون ريال",
            'source' => 'صحيفة مال',
            'language' => 'ar',
                       'publisher_id' => "صحيفه مال",

            'slug' => Str::slug("أرباح أماك تقفز"),
            'show_in_slider' => 1,
            'order_slider' => 5,
            'is_featured' => 1,
            'order_featured' => 4,
            'description' => "قفز صافي الربح لشركة المصانع الكبرى للتعدين “أماك” إلى 178 مليون ريال بنهاية العام 2024، مقابل 55 مليون ريال في العام الماضي بنسبة 226%، جاء ذلك عقب الإعلان اليوم عن النتائج المالية الأولية للفترة المنتهية في 31 ديسمبر 2024.
                    وبلغ الربح التشغيلي 222مليون ريال نهاية عام 2024 مقابل 64 مليون ريال في العام الماضي بنمو 247%.
                    كما بلغ حقوق الملكية (بعد استبعاد الحصص غير المسيطرة) في السنة الحالية 1.25 مليار ريال نهاية عام 2024 مقابل 1.22 مليار ريال في العام الماضي بزيادة 3%.
                    وبلغت ربحية السهم في السنة الحالية 2.01 ريال مقابل 0.73 ريال في السنة الماضية.
                    وقالت الشركة في بيان لها اليوم على “تداول” إن سبب الارتفاع في الإيرادات خلال هذا العام بمبلغ 293 مليون ريال (60%) مقارنة بالعام السابق يعود إلى ارتفاع أسعار وكميات مبيعات النحاس والزنك والذهب.",
            'main_image' => "/storage/uploads/photos/sliders/2025-02/slider4.png",
            'image_description' => "صورة متعلقة بخبر استثماري هام",
            'is_published' => 1,
            'status' => rand(1, 2),
            'type' => 'normal',
            'schudle_date' => null,
            'schudle_time' => null,
            'category_id' => Arr::random($arabicCategories),
            'created_at' => now()->subDay(),
            'updated_at' => now()->subDay(),

        ]);

        $news4->tags()->attach($this->getRandomTags($arabicTags));
    }

    public function getRandomTags($tagsArray)
    {
        if (empty($tagsArray)) {
            return [];
        }
        return collect($tagsArray)->random(min(rand(1, 3), count($tagsArray)))->toArray();
    }
}
